# CAO Points Analysis

File include detailed comparison of CAO points in 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020 and 2021 using the functionality in Pandas,
plus appropiate plots.

***

### Link to CAO Points Website
https://www.cao.ie/index.php?/page=point&p=2021

***

In [1]:
# Convinient package for making HTTP requests.
import requests as rq

# Regular expression.
import re

#Dates and times.
import datetime as dt

#To clean xlms and pdf files.
import pandas as pd

# For downloading.
import urllib.request as urlrq

### Link to CAO Points 2021 Website
https://www.cao.ie/index.php?/page=point&p=2021

***

### CAO Points 2021
***

In [2]:
# Fetch CAO points from the website.
resp = rq.get("http://www2.cao.ie/points/l8.php")
# Check if its connecting.
# resp

### Save original CAO data set to a HTML file. 

***

In [3]:
# Get the current date and time.
now = dt.datetime.now()
# Format as a string.
nowstr = now.strftime('%Y%m%d_%H%M%S')

In [4]:
# Creating timestamp in file as a filename itself.
pathhtml = 'data/cao2021_' + nowstr + '.html'

In [5]:
# The server uses the wrong encoding, fix it.
original_encoding = resp.encoding
# Change to cp1252
resp.encoding = 'cp1252'

In [6]:
# Save the original html file
with open(pathhtml, 'w') as f:
    f.write(resp.text)

### Use regular expression to select lines we want.

***

In [7]:
# Compile regular expression for matching lines.
re_course = re.compile(r'([A-Z]{2}[0-9]{3})(.*)')

### Loop through the lines of the response.
***

In [8]:
# Writing sorted CAO data to a CSV file. 
path2021 = 'data/cao2021_csv_' + nowstr + '.csv'

In [9]:
# Keep track of how many courses we process.
no_lines = 0

# Open the csv file for writing.
with open(path2021, 'w') as f:
    # Write a header row.
    f.write(','.join(['code', 'title', 'pointsR1', 'pointsR2']) + '\n')
    # Loop through lines of the response.
    for line in resp.iter_lines():
        # Decode the line, using the wrong encoding!
        dline = line.decode('cp1252')
        # Match only the lines representing courses.
        if re_course.fullmatch(dline):
            # Add one to the lines counter.
            no_lines = no_lines + 1
            # The course code.
            course_code = dline[:5]
            # The course title.
            course_title = dline[7:57].strip()
            # Round one points.
            course_points = re.split(' +', dline[60:])
            if len(course_points) != 2:
                course_points = course_points[:2]
            # Join the fields using a comma.
            linesplit = [course_code, course_title, course_points[0], course_points[1]]
            #clear linesplit[2] from # and *
            #print(linesplit[2])
            # Rejoin the substrings with commas in between.
            f.write(','.join(linesplit) + '\n')

# Print the total number of processed lines.
print(f"Total number of lines is {no_lines}.")

Total number of lines is 949.

In [10]:
df2021 = pd.read_csv(path2021, encoding='cp1252')

In [11]:
df2021

,code,title,pointsR1,pointsR2
0,AL801,Software Design for Virtual Reality and Gaming,300,NaN
1,AL802,Software Design in Artificial Intelligence for...,313,NaN
2,AL803,Software Design for Mobile Apps and Connected ...,350,NaN
3,AL805,Computer Engineering for Network Infrastructure,321,NaN
4,AL810,Quantity Surveying,328,NaN
...,...,...,...,...
944,WD211,Creative Computing,270,NaN
945,WD212,Recreation and Sport Management,262,NaN
946,WD230,Mechanical and Manufacturing Engineering,230,230
947,WD231,Early Childhood Care and Education,266,NaN
948,WD232,Business Information Systems,261,261

### Link to CAO Points 2020 

http://www2.cao.ie/points/CAOPointsCharts2020.xlsx

***

### CAO Points 2020 

xmls file , cleaning, fetching,  saving to file converted data and raw data

***

### Save Original File
***

In [12]:
# Create a file path for the original data.
pathxlsx = 'data/cao2020_' + nowstr + '.xlsx'

In [13]:
urlrq.urlretrieve('http://www2.cao.ie/points/CAOPointsCharts2020.xlsx', pathxlsx)

('data/cao2020_20211123_184941.xlsx',
 <http.client.HTTPMessage at 0x1af62088c10>)

### Load Spreadsheet using Pandas
***

In [14]:
# Download and parse the excel spreadsheet.
df2020 = pd.read_excel('http://www2.cao.ie/points/CAOPointsCharts2020.xlsx', skiprows=10)

In [15]:
df2020.head()

,CATEGORY (i.e.ISCED description),COURSE TITLE,COURSE CODE2,R1 POINTS,R1 Random *,R2 POINTS,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Business and administration,International Business,AC120,209,NaN,NaN,NaN,209,NaN,280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Humanities (except languages),Liberal Arts,AC137,252,NaN,NaN,NaN,252,NaN,270,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
# Spot check a random row.
df2020.iloc[753]

CATEGORY (i.e.ISCED description)          Engineering and engineering trades
COURSE TITLE                        Road Transport Technology and Management
COURSE CODE2                                                           LC286
R1 POINTS                                                                264
R1 Random *                                                              NaN
R2 POINTS                                                                NaN
R2 Random*                                                               NaN
EOS                                                                      264
EOS Random *                                                             NaN
EOS Mid-point                                                            360
LEVEL                                                                      7
HEI                                         Limerick Institute of Technology
Test/Interview #                                                         NaN
avp                                                                      NaN
v                                                                        NaN
Column1                                                                  NaN
Column2                                                                  NaN
Column3                                                                  NaN
Column4                                                                  NaN
Column5                                                                  NaN
Column6                                                                  NaN
Column7                                                                  NaN
Column8                                                                  NaN
Name: 753, dtype: object

In [17]:
# Spot check the last row.
df2020.iloc[-1]

CATEGORY (i.e.ISCED description)          Engineering and engineering trades
COURSE TITLE                        Mechanical and Manufacturing Engineering
COURSE CODE2                                                           WD230
R1 POINTS                                                                253
R1 Random *                                                              NaN
R2 POINTS                                                                NaN
R2 Random*                                                               NaN
EOS                                                                      253
EOS Random *                                                             NaN
EOS Mid-point                                                            369
LEVEL                                                                      8
HEI                                        Waterford Institute of Technology
Test/Interview #                                                         NaN
avp                                                                      NaN
v                                                                        NaN
Column1                                                                  NaN
Column2                                                                  NaN
Column3                                                                  NaN
Column4                                                                  NaN
Column5                                                                  NaN
Column6                                                                  NaN
Column7                                                                  NaN
Column8                                                                  NaN
Name: 1463, dtype: object

In [18]:
# Create a file path for the pandas data.
path = 'data/cao2020_' + nowstr + '.csv'

In [19]:
# Save pandas data frame to disk.
df2020.to_csv(path)

In [20]:
df2020.head()

,CATEGORY (i.e.ISCED description),COURSE TITLE,COURSE CODE2,R1 POINTS,R1 Random *,R2 POINTS,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Business and administration,International Business,AC120,209,NaN,NaN,NaN,209,NaN,280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Humanities (except languages),Liberal Arts,AC137,252,NaN,NaN,NaN,252,NaN,270,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Link CAO Points 2019 
https://www.cao.ie/index.php?page=points&p=2019
***

### CAO Points 2019
***

##### Preparation CAO 2019 pdf file for editing in Pandas ( steps)
- Downloading original file from the website - CAO Points 2019 - pdf file - lvl8_19.pdf  
- Open original pdf file in Microsoft Word.
- Save Microsoft Word's converted PDF in docx format.
- Re-save Word document for editing.
- Delete headers and footers.
- Delete preamble on page 1.
- Select all and copy.
- Paste into Notepad++.
- Remove HEI name headings and paste onto each course line.
- Delete blank lines.
- Replace " ` " to " ' ".
- Remove empty spaces at the end of the lines ( tabs, spaces)

In [21]:
# Read CAO Points 2019 edited from csv (tsv) file to pandas
df2019 = pd.read_csv("data/lvl8_19_20211115_1016_edited.csv", sep="\t")
df2019.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design with Virtual Reality and Gaming,304,328.0
1,Athlone Institute of Technology,AL802,Software Design with Cloud Computing,301,306.0
2,Athlone Institute of Technology,AL803,Software Design with Mobile Apps and Connected...,309,337.0
3,Athlone Institute of Technology,AL805,Network Management and Cloud Infrastructure,329,442.0
4,Athlone Institute of Technology,AL810,Quantity Surveying,307,349.0

##### Years from 2018 - 2010 , downloading , prepering files, all should be pdf files

### Link CAO Points 2018
https://www.cao.ie/index.php?page=points&p=2018
***

##### Preparing CAO 2018 pdf file for editing in Pandas

In [22]:
# Read CAO Points 2018 edited from csv (tsv) file to pandas
df2018 = pd.read_csv("data/CAO2018_20211115_edited.csv", sep="\t")
df2018.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design (Game Development or Cloud Com...,295,326.0
1,Athlone Institute of Technology,AL810,Quantity Surveying,300,340.0
2,Athlone Institute of Technology,AL820,Mechanical and Polymer Engineering,299,371.0
3,Athlone Institute of Technology,AL830,General Nursing,418,440.0
4,Athlone Institute of Technology,AL832,Psychiatric Nursing,377,388.0

### Link CAO Points 2017
https://www.cao.ie/index.php?page=points&p=2017
***

##### Preparing CAO 2017 pdf file for editing in Pandas

In [23]:
# Read CAO Points 2017 edited from csv (tsv) file to pandas
df2017 = pd.read_csv("data/CAO2017_edited.csv", sep="\t")
df2017.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design (Game Development or Cloud Com...,290,329.0
1,Athlone Institute of Technology,AL810,Quantity Surveying,311,357.0
2,Athlone Institute of Technology,AL820,Mechanical and Polymer Engineering,300,336.0
3,Athlone Institute of Technology,AL830,General Nursing,398*,418.0
4,Athlone Institute of Technology,AL832,Psychiatric Nursing,378,389.0

### Link CAO Points 2016
https://www.cao.ie/index.php?page=points&p=2016
***

##### Preparing CAO 2016 pdf file for editing in Pandas

In [24]:
# Read CAO Points 2016 edited from csv (tsv) file to pandas
df2016 = pd.read_csv("data/CAO2016_edited.csv", sep="\t")
df2016.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design (Game Development or Cloud Com...,300,340.0
1,Athlone Institute of Technology,AL810,Quantity Surveying,315,355.0
2,Athlone Institute of Technology,AL820,Mechanical and Polymer Engineering,295,340.0
3,Athlone Institute of Technology,AL830,General Nursing,425*,440.0
4,Athlone Institute of Technology,AL831,Mature Applicants General Nursing,#181,185.0

### Link CAO Points 2015
https://www.cao.ie/index.php?page=points&p=2015
***

##### Preparing CAO 2015 pdf file for editing in Pandas

In [25]:
# Read CAO Points 2015 edited from csv (tsv) file to pandas
df2015 = pd.read_csv("data/CAO2015_edited.csv", sep="\t")
df2015.head()

,Institution,Code,Course,EOS,Mid
0,Athlone Institute of Technology,AL801,Software Design (Game Development or Cloud Com...,280,345.0
1,Athlone Institute of Technology,AL820,Mechanical and Polymer Engineering,315,355.0
2,Athlone Institute of Technology,AL830,General Nursing,420,435.0
3,Athlone Institute of Technology,AL831,Mature Applicants General Nursing,#176*,182.0
4,Athlone Institute of Technology,AL832,Psychiatric Nursing,390,400.0

### Link CAO Points 2014
https://www.cao.ie/index.php?page=points&p=2014
***

##### Preparing CAO 2014 pdf file for editing in Pandas

In [26]:
# Read CAO Points 2014 edited from csv (tsv) file to pandas
df2014 = pd.read_csv("data/CAO2014_edited.csv", sep="\t")
df2014.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL801,Software Design (Common Entry,280,335
1,ATHLONE IT,AL820,Mechanical and Polymer Engineering ...,315,365
2,ATHLONE IT,AL830,General Nursing ...,410,420
3,ATHLONE IT,AL831,Mature Applicants General Nursing ...,#169,173
4,ATHLONE IT,AL832,Psychiatric Nursing ...,390,395

### Link CAO Points 2013
https://www.cao.ie/index.php?page=points&p=2013
***

##### Preparing CAO 2013 pdf file for editing in Pandas

In [27]:
# Read CAO Points 2013 edited from csv (tsv) file to pandas
df2013 = pd.read_csv("data/CAO2013_edited.csv", sep="\t")
df2013.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL802,Software Design (Games Development) ...,275,325
1,ATHLONE IT,AL803,Software Design (Cloud Computing) ...,280,345
2,ATHLONE IT,AL830,General Nursing ...,410*,415
3,ATHLONE IT,AL831,Mature Applicants General Nursing ...,566#,581
4,ATHLONE IT,AL832,Psychiatric Nursing ...,395,400

### Link CAO Points 2012
https://www.cao.ie/index.php?page=points&p=2012
***

##### Preparing CAO 2012 pdf file for editing in Pandas

In [28]:
# Read CAO Points 2012 edited from csv (tsv) file to pandas
df2012 = pd.read_csv("data/CAO2012_edited.csv", sep="\t")
df2012.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL802,Software Design (Games Development) ...,300,340
1,ATHLONE IT,AL803,Software Design (Web Development) ...,310,335
2,ATHLONE IT,AL805,Construction Technology and Management ...,NaN,NaN
3,ATHLONE IT,AL830,General Nursing ...,415*,430
4,ATHLONE IT,AL831,Mature Applicants General Nursing ...,233#,235

### Link CAO Points 2011
https://www.cao.ie/index.php?page=points&p=2011
***

##### Preparing CAO 2011 pdf file for editing in Pandas

In [29]:
# Read CAO Points 2011 edited from csv (tsv) file to pandas
df2011 = pd.read_csv("data/CAO2011_edited.csv", sep="\t")
df2011.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL032,Software Design (Games Development) ...,285,330
1,ATHLONE IT,AL033,Toxicology ...,240,330
2,ATHLONE IT,AL034,Software Design (Web Development) ...,285,340
3,ATHLONE IT,AL035,Construction Technology and Management ...,265,315
4,ATHLONE IT,AL050,Business ...,270,325

### Link CAO Points 2010
https://www.cao.ie/index.php?page=points&p=2010
***

##### Preparing CAO 2010 pdf file for editing in Pandas

In [30]:
# Read CAO Points 2010 edited from csv (tsv) file to pandas
df2010 = pd.read_csv("data/CAO2010_edited.csv", sep="\t")
df2010.head()

,Institution,Code,Course,EOS,Mid
0,ATHLONE IT,AL032,Software Design (Games Development) ...,265 (375v),315
1,ATHLONE IT,AL033,Toxicology ...,280,345
2,ATHLONE IT,AL034,Software Design (Web Development) ...,270,300
3,ATHLONE IT,AL035,Construction Technology and Management ...,265,310
4,ATHLONE IT,AL050,Business ...,275,320

***
***

In [31]:
# create new data frame containing data that we want
# check for unique, clear duplicates
# clear * and # in pandas

#### Merching data from different years.

In [32]:
#take two columns from cao 2021 data
courses2021 = df2021[["code", "title"]]
courses2021

      code                                              title
0    AL801     Software Design for Virtual Reality and Gaming
1    AL802  Software Design in Artificial Intelligence for...
2    AL803  Software Design for Mobile Apps and Connected ...
3    AL805    Computer Engineering for Network Infrastructure
4    AL810                                 Quantity Surveying
..     ...                                                ...
944  WD211                                 Creative Computing
945  WD212                    Recreation and Sport Management
946  WD230           Mechanical and Manufacturing Engineering
947  WD231                 Early Childhood Care and Education
948  WD232                       Business Information Systems

[949 rows x 2 columns]

In [33]:
# take two columns from cao 2020
courses2020 = df2020[["COURSE CODE2", "COURSE TITLE"]]

# change the labels of columns
courses2020.columns = ["code", "title"]
courses2020

       code                                              title
0     AC120                             International Business
1     AC137                                       Liberal Arts
2     AD101   First Year Art & Design (Common Entry,portfolio)
3     AD102  Graphic Design and Moving Image Design (portfo...
4     AD103  Textile & Surface Design and Jewellery & Objec...
...     ...                                                ...
1459  WD208                          Manufacturing Engineering
1460  WD210                       Software Systems Development
1461  WD211                                 Creative Computing
1462  WD212                    Recreation and Sport Management
1463  WD230           Mechanical and Manufacturing Engineering

[1464 rows x 2 columns]

Let's get list of all the courses that we had.

In [34]:
#create new data frame with all data
allcourses = pd.concat([courses2021, courses2020], ignore_index=True)
allcourses

       code                                              title
0     AL801     Software Design for Virtual Reality and Gaming
1     AL802  Software Design in Artificial Intelligence for...
2     AL803  Software Design for Mobile Apps and Connected ...
3     AL805    Computer Engineering for Network Infrastructure
4     AL810                                 Quantity Surveying
...     ...                                                ...
2408  WD208                          Manufacturing Engineering
2409  WD210                       Software Systems Development
2410  WD211                                 Creative Computing
2411  WD212                    Recreation and Sport Management
2412  WD230           Mechanical and Manufacturing Engineering

[2413 rows x 2 columns]

In [35]:
allcourses.sort_values('code')

       code                                             title
175   AC120                            International Business
949   AC120                            International Business
950   AC137                                      Liberal Arts
176   AC137                                      Liberal Arts
951   AD101  First Year Art & Design (Common Entry,portfolio)
...     ...                                               ...
2411  WD212                   Recreation and Sport Management
2412  WD230          Mechanical and Manufacturing Engineering
946   WD230          Mechanical and Manufacturing Engineering
947   WD231                Early Childhood Care and Education
948   WD232                      Business Information Systems

[2413 rows x 2 columns]

In [36]:
#check duplicates 
allcourses.loc[175]['title']

'International Business'

In [37]:
allcourses.loc[949]['title']

'International Business'

In [38]:
#above discribe with strip in 2021

In [39]:
allcourses.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2408    False
2409     True
2410     True
2411     True
2412     True
Length: 2413, dtype: bool

In [40]:
allcourses[allcourses.duplicated()]

       code                                              title
949   AC120                             International Business
950   AC137                                       Liberal Arts
952   AD102  Graphic Design and Moving Image Design (portfo...
955   AD204                               Fine Art (portfolio)
956   AD211                         Fashion Design (portfolio)
...     ...                                                ...
2404  WD200                                     Arts (options)
2409  WD210                       Software Systems Development
2410  WD211                                 Creative Computing
2411  WD212                    Recreation and Sport Management
2412  WD230           Mechanical and Manufacturing Engineering

[739 rows x 2 columns]

In [41]:
# returns a copy of the data frame with duplicates removed.
allcourses.drop_duplicates()

       code                                              title
0     AL801     Software Design for Virtual Reality and Gaming
1     AL802  Software Design in Artificial Intelligence for...
2     AL803  Software Design for Mobile Apps and Connected ...
3     AL805    Computer Engineering for Network Infrastructure
4     AL810                                 Quantity Surveying
...     ...                                                ...
2403  WD195  Architectural and Building Information Modelli...
2405  WD205   Molecular Biology with Biopharmaceutical Science
2406  WD206                             Electronic Engineering
2407  WD207                             Mechanical Engineering
2408  WD208                          Manufacturing Engineering

[1674 rows x 2 columns]

In [42]:
allcourses[allcourses.duplicated(subset=['code'])]

       code                                              title
949   AC120                             International Business
950   AC137                                       Liberal Arts
951   AD101   First Year Art & Design (Common Entry,portfolio)
952   AD102  Graphic Design and Moving Image Design (portfo...
953   AD103  Textile & Surface Design and Jewellery & Objec...
...     ...                                                ...
2404  WD200                                     Arts (options)
2409  WD210                       Software Systems Development
2410  WD211                                 Creative Computing
2411  WD212                    Recreation and Sport Management
2412  WD230           Mechanical and Manufacturing Engineering

[896 rows x 2 columns]

In [43]:
allcourses.drop_duplicates(subset=["code"], inplace=True, ignore_index=True)
allcourses

       code                                              title
0     AL801     Software Design for Virtual Reality and Gaming
1     AL802  Software Design in Artificial Intelligence for...
2     AL803  Software Design for Mobile Apps and Connected ...
3     AL805    Computer Engineering for Network Infrastructure
4     AL810                                 Quantity Surveying
...     ...                                                ...
1512  WD188                                Applied Health Care
1513  WD205   Molecular Biology with Biopharmaceutical Science
1514  WD206                             Electronic Engineering
1515  WD207                             Mechanical Engineering
1516  WD208                          Manufacturing Engineering

[1517 rows x 2 columns]

In [44]:
# set the index to the code column
df2021.set_index('code', inplace=True)
df2021.columns = ['title', 'points_r1_2021', 'points_r2_2021']

#### JOIN

In [45]:
# add columns with points to 'allcourses' table
# joining tables
# changing index for code column ( unique values)
allcourses.set_index('code', inplace=True)

In [47]:
# add points 2021 to table
allcourses = allcourses.join(df2021[['points_r1_2021']])
allcourses

                                                   title points_r1_2021
code
AL801     Software Design for Virtual Reality and Gaming            300
AL802  Software Design in Artificial Intelligence for...            313
AL803  Software Design for Mobile Apps and Connected ...            350
AL805    Computer Engineering for Network Infrastructure            321
AL810                                 Quantity Surveying            328
...                                                  ...            ...
WD188                                Applied Health Care            NaN
WD205   Molecular Biology with Biopharmaceutical Science            NaN
WD206                             Electronic Engineering            NaN
WD207                             Mechanical Engineering            NaN
WD208                          Manufacturing Engineering            NaN

[1517 rows x 2 columns]

In [48]:
# add points 2020 in the table 
df2020_r1 = df2020[['COURSE CODE2', 'R1 POINTS']]
df2020_r1.columns = ['code', 'points_R1_2020']
df2020_r1

       code points_R1_2020
0     AC120            209
1     AC137            252
2     AD101       #+matric
3     AD102       #+matric
4     AD103       #+matric
...     ...            ...
1459  WD208            188
1460  WD210            279
1461  WD211            271
1462  WD212            270
1463  WD230            253

[1464 rows x 2 columns]

In [49]:
df2020_r1.set_index('code', inplace=True)
df2020_r1

      points_R1_2020
code
AC120            209
AC137            252
AD101       #+matric
AD102       #+matric
AD103       #+matric
...              ...
WD208            188
WD210            279
WD211            271
WD212            270
WD230            253

[1464 rows x 1 columns]

In [51]:
# Join 2020 to allcourses.
allcourses = allcourses.join(df2020_r1)
allcourses

,title,points_r1_2021,points_R1_2020
code,,,
AL801,Software Design for Virtual Reality and Gaming,300,303
AL802,Software Design in Artificial Intelligence for...,313,332
AL803,Software Design for Mobile Apps and Connected ...,350,337
AL805,Computer Engineering for Network Infrastructure,321,333
AL810,Quantity Surveying,328,319
...,...,...,...
WD188,Applied Health Care,NaN,201
WD205,Molecular Biology with Biopharmaceutical Science,NaN,228
WD206,Electronic Engineering,NaN,179
WD207,Mechanical Engineering,NaN,198
WD208,Manufacturing Engineering,NaN,188

### REFERENCES:
    1.
    2.
    3.